_posts/2015-11-19-Functional-and-display-math-in-technical-documents.html
---
title: Functional and display math in technical documents
date: 2015/11/19 06:07:15
updated: 2015/11/19 14:43:12
categories: emacs,orgmode
tags: 
---


<p>
I have been thinking about a way to have functional and readable mathematics in technical documents. It has always bothered me that I have to write a LaTeX version of an equation, and then a separate implementation of the equation in code somewhere. At least twice in my life these separate representations have not agreed!
</p>

<p>
One solution might be if my functional code could be converted to LaTeX easily. I explore one simple approach to this here. It is somewhat inspired by this work here <a href="http://oremacs.com/2015/01/23/eltex/">http://oremacs.com/2015/01/23/eltex/</a> on writing LaTeX in emacs-lisp, and from my work with org-mode in mixing narrative text, LaTeX and code.
</p>

<p>
The idea is to use emacs-lisp for the code, so it is functional, but provide an alternative output for the <i>same code</i> for a document conversion. In other words, we accept there is more than one version we need: a functional version for working, and a consumption version for presentation. We will generate the consumption version from the functional version.
</p>

<p>
I know emacs-lisp is not ideal for mathematics the way we are accustomed to seeing it, but it enables the idea I want to explore here so we will try it.
</p>

<p>
Here is the simplest example I could come up with for functional math. We can run it ourselves, and verify it is correct.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(+ 1 2 3)
</pre>
</div>

<pre class="example">
6
</pre>

<p>
Now, I can change the meaning of this code temporarily, so that it not only evaluates the form, but also represents the equation and result in LaTeX code. If this was incorporated into a preprocessor of the document, we could have a functional version representing our equations, in code form, and a presentation version generated from this version. The code that follows isn't how I would do this is in some production setting; it is only to show that you can <i>temporarily</i> change the meaning of "+". In a production setting, there would just be (+ 1 2 3) in the text, and a preprocessor would find all the sexps in the text, and replace them with the export format using code like this. At least, that is what I am imagining. It might be feasible to do this already with inline org-babel calls and an org-mode export filter, but I didn't try it here. So, here is the proof of concept code.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #0000FF;">cl-flet</span> ((+ (<span style="color: #0000FF;">lambda</span> (<span style="color: #6434A3;">&amp;rest</span> args)
               (format
                <span style="color: #008000;">"$%s = %s$"</span>
                (mapconcat #'number-to-string args <span style="color: #008000;">" + "</span>)
                (eval `(+ ,@args))))))
  (+ 1 2 3))
</pre>
</div>

<p>
\(1 + 2 + 3 = 6\)
</p>



<p>
Here is an example that generates a fraction from a division.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #0000FF;">cl-flet</span> ((/ (<span style="color: #0000FF;">lambda</span> (<span style="color: #6434A3;">&amp;rest</span> args)
               (format
                <span style="color: #008000;">"$\\frac{%s}{%s} = %s$"</span>
                (car args)
                (mapconcat 'number-to-string (cdr args) <span style="color: #008000;">" \\cdot "</span>)
                (eval `(/ ,@args))))))
  (/ 1.0 2.0 3.0))
</pre>
</div>

<p>
\(\frac{1.0}{2.0 \cdot 3.0} = 0.16666666666666666\)
</p>

<p>
As a proof of concept, this idea looks feasible, but this implementation has some limitations. Getting this to a complete workable approach would require a lot of work, basically creating transformation functions for many, many kinds of mathematical functions, and a lot of other kinds of logic. For example, (+ 1 2 (+ 3 4)) would not render correctly with the codes above. It isn't even clear what it should render to. I think you want 1 + 2 + (3 + 4) as the rendered output.
</p>

<p>
Anyway, it is an interesting idea, one that blurs the lines between code and mathematics. We are so used to the equation representation of mathematics, rather than the code representation that being able to go back and forth seems like a good idea, especially when one is derived from the other.
</p>
<p>Copyright (C) 2015 by John Kitchin. See the <a href="/copying.html">License</a> for information about copying.<p><p><a href="/org/2015/11/19/Functional-and-display-math-in-technical-documents.org">org-mode source</a><p><p>Org-mode version = 8.2.10</p>